julianm-7/Stepper_Motor_MSP430_Microcontroller/main.c

#include <stdint.h>
#include <stdio.h>
#include "LcdDrivermsp430/Crystalfontz128x128_ST7735.h"
#include "LcdDrivermsp430/HAL_MSP_EXP430FR5994_Crystalfontz128x128_ST7735.h"
#include "HAL_FR5994_OPT3001.h"
#include "HAL_FR5994_I2CLIB.h"
#include "grlib.h"
#include "driverlib.h"
#define CMASK BIT5
#define definePeriod 301 //301 original value
#define OPTADDRESS 0x44
#define highLimit 30874
#define lowLimit 1095
#pragma diag_suppress=169
void configurePort6();
void configurePort4();
void initTimerA0();
void TIMER_A_configureUpMode();
void hardwareConf();
void myMotorDriver();
void myMotorController();
void FR5994_I2C_init();
void OPT3001_configReg();
void OPT3001_writeHighLimitReg();
void OPT3001_writeLowLimitReg();
void PatternModeFunction();
void PatternModeCheck();
void initializeALL();
typedef enum {OFF,LOW,HIGH,PATTERN,CW,CCW,ON,LightSensorForward,LightSensorBackward,PushButtonForward,PushButtonBackward,StartUp} ProgramMode ;
Graphics_Context g_sContext;
volatile ProgramMode SpeedMode,MotorMode,TextMode,TrackerMode,PatternModeSpeed;
volatile int32_t globalStepCount;
volatile uint16_t value,value2;
volatile uint16_t period;
volatile uint16_t configData;
volatile uint8_t PBS1,PBS2;
volatile uint16_t value3;
volatile int8_t motorSeq;
volatile ProgramMode patternTracker[40];
volatile ProgramMode patternSequence[]= {LOW,OFF,LOW,OFF,LOW,OFF,LOW,OFF};
volatile uint16_t pSteps,nSteps;
volatile int32_t arrayTracker=0;
volatile char buffer[100];
int ii,j,xx,yy;
uint8_t x=0;

void main()
{
    initializeALL();
    while(1)
    {
        GPIO_toggleOutputOnPin(GPIO_PORT_P1,GPIO_PIN1);
        __delay_cycles(30000);
        PatternModeCheck();
    }
}

#pragma vector= TIMER0_A0_VECTOR
__interrupt void timerISR()
{
    uint16_t lightReading;
    if (TrackerMode==TextMode)
    {}
    else
    {
        if (TrackerMode==PATTERN)
        {
            Graphics_clearDisplay(&g_sContext);
        }
        switch (TextMode)
        {
        case PushButtonForward:
            sprintf(buffer," Push Button ");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,40,OPAQUE_TEXT);
            sprintf(buffer,"CW at High Speed");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,50,OPAQUE_TEXT);
            break;
        case PushButtonBackward:
            sprintf(buffer," Push Button ");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,40,OPAQUE_TEXT);
            sprintf(buffer,"CCW at Low Speed");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,50,OPAQUE_TEXT);
            break;
        case LightSensorForward:
            sprintf(buffer,"Light Sensor");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,40,OPAQUE_TEXT);
            sprintf(buffer,"CW at High Speed");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,50,OPAQUE_TEXT);
            break;
        case LightSensorBackward:
            sprintf(buffer,"Light Sensor");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,40,OPAQUE_TEXT);
            sprintf(buffer,"CCW at Low Speed");
            Graphics_drawStringCentered(&g_sContext,buffer,AUTO_STRING_LENGTH,64,50,OPAQUE_TEXT);
            break;
        case PATTERN:
            pSteps=0;
            nSteps=0;
            break;
            // LCD display will print within PatternModeFunction();
        }
            TrackerMode=TextMode;
    }
    Timer_A_stop (TIMER_A0_BASE);
    int i=0;
    if (x==1)
    {
        for (i=0;i<9;i++)
        {
            SpeedMode=PATTERN;
            myMotorController();
        }
    }
    else
    {
    myMotorController();
    }
    lightReading= I2C_read16(RESULT_REG);
    while ((lightReading<lowLimit) || (lightReading>highLimit))
    {
        TA0CCTL0= (TA0CCTL0 & (~BIT0));
        initTimerA0();
        while ((TA0CCTL0 & BIT0) != BIT0){}
        myMotorController();
        lightReading= I2C_read16(RESULT_REG);
    }
    TA0CCTL0= (TA0CCTL0 & (~BIT0));
}

#pragma vector = PORT6_VECTOR
__interrupt void lightSensorISR()
{
    GPIO_clearInterrupt(GPIO_PORT_P6,GPIO_PIN3);
    initTimerA0();
    configData=OPT3001_readConfigReg(OPTADDRESS);
    if ((configData&CMASK) == BIT5)
    {
        SpeedMode=LOW;
        TextMode=LightSensorBackward;
    }
    else
    {
        SpeedMode=HIGH;
        TextMode=LightSensorForward;
    }
    switch (SpeedMode)
    {
    case LOW:
        period= definePeriod;
        break;
    case HIGH:
        period= definePeriod/2;
        break;
    }
    while ((TA0CCTL0 & BIT0) != BIT0)
    {}
}

#pragma vector = PORT5_VECTOR
__interrupt void pushButtonISR()
{
    uint8_t tracker=0;
    PBS1=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN6);
    PBS2=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN5);
    if ((PBS2&PBS1)==0)
    {
        initTimerA0();
        tracker=1;
    }
    PBS1=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN6);
    PBS2=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN5);
    if ((PBS1==0) && (PBS2==0))
    {
        SpeedMode=PATTERN;
        TextMode=PATTERN;
    }
    else if (PBS1==0)
    {
        SpeedMode=LOW;
        TextMode=PushButtonBackward;
    }
    else if (PBS2==0)
    {
        SpeedMode=HIGH;
        TextMode=PushButtonForward;
    }
    switch (SpeedMode)
    {
    case LOW:
        period= definePeriod;
        break;
    case HIGH:
        period= definePeriod/2;
        break;
    }

    PBS1=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN6);
    PBS2=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN5);
    if (PBS1!=0)
    {
    GPIO_clearInterrupt(GPIO_PORT_P5,GPIO_PIN6);
    }
    if (PBS2!=0)
    {
    GPIO_clearInterrupt(GPIO_PORT_P5,GPIO_PIN5);
    }
    PBS1=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN6);
    PBS2=GPIO_getInputPinValue(GPIO_PORT_P5,GPIO_PIN5);
    if (tracker)
    {
        while ((TA0CCTL0 & BIT0) != BIT0)
        {}
    }

